//Напишіть програму, яка обчислює об’єм кулі.

#include <iostream>
#include <cmath> // Підключаємо бібліотеку для математичних операцій

int main() {
    double radius, volume;

    // Вивід привітання та запит на введення вихідних даних
    std::cout << "Обчислення об'єму кулі." << std::endl;
    std::cout << "Введіть радіус кулі (см): ";
    std::cin >> radius;

    // Обчислення об'єму кулі
    volume = (4.0 / 3.0) * M_PI * pow(radius, 3);

    // Вивід результату
    std::cout << "Об'єм кулі: " << volume << " куб. см." << std::endl;

    return 0;
}
