#include <iostream>

//Написати програму обчислення об’єму паралелепіпеда.Нижче наведено рекомендований вигляд
//екрану під час виконання програми.
//Обчислення об’єму паралелепіпеда.
//Введіть вихідні дані :
//Довжина(см) -> 9;
//Ширина(см) -> 7.5;
//Висота(см) -> 5;
//Об’єм: 337.50 куб.см.

int main() {
    double length, width, height, volume;

    // Вивід привітання та запит на введення вихідних даних
    std::cout << "Обчислення об'єму паралелепіпеда." << std::endl;
    std::cout << "Введіть вихідні дані:" << std::endl;

    // Зчитування довжини
    std::cout << "Довжина (см) -> ";
    std::cin >> length;

    // Зчитування ширини
    std::cout << "Ширина (см) -> ";
    std::cin >> width;

    // Зчитування висоти
    std::cout << "Висота (см) -> ";
    std::cin >> height;

    // Обчислення об'єму паралелепіпеда
    volume = length * width * height;

    // Вивід результату
    std::cout << "Об'єм: " << volume << " куб. см." << std::endl;

    return 0;
}
